---
kind: property
id: P:Autodesk.Revit.DB.Visual.Ceramic.CeramicPattern
source: html/97bb3b43-3f87-6c02-0d5b-c8268224d60b.htm
---
# Autodesk.Revit.DB.Visual.Ceramic.CeramicPattern Property

The property labeled "Relief Pattern" from the "Ceramic" schema.

## Syntax (C#)
```csharp
public static string CeramicPattern { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicPatternType".